In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

Activity 12-2
------------

MVDS.  First load the following table:

In [15]:
%%sql
DROP TABLE IF EXISTS courses;
CREATE TABLE courses (course TEXT, staff TEXT, student TEXT);
INSERT INTO courses VALUES ('CS949','Amy','Bob');
INSERT INTO courses VALUES ('CS145','Chris','Deb');
INSERT INTO courses VALUES ('CS145','Chris','Eli');
INSERT INTO courses VALUES ('CS145','Firas','Deb');
--INSERT INTO courses VALUES ('CS145','Firas','Bob');
INSERT INTO courses VALUES ('CS145','Firas','Eli');

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[]

### Exercise 1

We developed some appealingly simple python tools for this lecture & last, but let's switch back to SQL quickly- write a query which returns **no values _only if_** the MVD course to staff holds

Then, comment out the insert statement(s) above so that the MVD does hold (do you remember how to comment out lines in SQL from earlier activities?  It's super useful!)

In [16]:
%%sql
SELECT *
FROM courses AS c1, courses AS c2
WHERE c1.course = c2.course AND NOT EXISTS (
    SELECT *
    FROM courses AS c3
    WHERE c3.course = c1.course
        AND c3.staff = c1.staff
        AND c3.student = c2.student);

 * sqlite://
Done.

[]

In [17]:
%%sql SELECT A.course, B.staff, A.student FROM 
    (SELECT DISTINCT course, student FROM courses) AS A,
    (SELECT DISTINCT course, staff FROM courses) AS B
WHERE A.course = B.course
AND NOT EXISTS (SELECT * FROM courses C
                WHERE A.course = C.course AND
                B.staff = C.staff AND A.student = C.student)

 * sqlite://
Done.

[]